Revit 2026 API

# FilterElementIsNameUnique(String) Method

---

Determines whether a potential filter element name is unique.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsNameUnique(
	string name
)
```
```vb
Public Function IsNameUnique (
	name As String
) As Boolean
```
```cpp
public:
bool IsNameUnique(
	String^ name
)
```
```fsharp
member IsNameUnique :
        name : string -> bool
```

#### Parameters

name String
     The candidate name.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FilterElement Class

IsNameUnique Overload

Autodesk.Revit.DB Namespace